Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: སྲས་ནི་རྡོ་རྗེའི་སྡེ་ཞེས་བྱའོ། །
en: Vajra Force will be his son.

source: རིམ་གྲོ་པ་ནི་རིན་ཆེན་དགའ་ཞེས་བྱའོ། །
en: Jewel Joy will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཉི་མའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Sun Essence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཁ་ལོ་སྒྱུར་ཞེས་བྱའོ། །
en: Leader will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་འབུམ་ཕྲག་སུམ་ཁྲིའོ། །གཉིས་པ་ལ་ནི་འབུམ་ཕྲག་ལྔ་ཁྲིའོ། །འདུས་པ་གསུམ་པ་ལ་ནི་ཉན་ཐོས་འབུམ་ཕྲག་དྲུག་ཁྲིའོ། །
en: His first congregation will consist of one hundred thirty thousand hearers, his second of one hundred fifty thousand hearers, and his third of one hundred sixty thousand hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བྱེ་བའོ། །
en: The extent of his lifespan will be ten million years.

source: དམ་པའི་ཆོས་ནི་ལོ་བྱེ་བ་ཕྲག་གསུམ་གྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for thirty million years.

source: དེ་བཞིན་གཤེགས་པ་སྒྲ་གཅན་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་འོད་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Rāhu will be called Jewel Light.

source: འོད་ནི་དཔག་ཚད་བདུན་ཅུ་རྩ་དྲུག་གོ། །
en: His light will extend seventy-six leagues.

source: ཡབ་ནི་མཐུ་རྩལ་སྟོབས་ཞེས་བྱའོ། །
en: Powerful Strength will be his father.

source: ཡུམ་ནི་ཟིལ་མི་ནོན་ཅེས་བྱའོ། །
en: Indomitable will be his mother.

source: སྲས་ནི་ཟླ་འོད་ཅེས་བྱའོ། །
en: Moonlight will be his son.

source: རིམ་གྲོ་པ་ནི་བཻ་དཱུརྱའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Beryl Essence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོབས་ལྷ་ཞེས་བྱའོ། །
en: God of Strength will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགའ་སྲེད་ཅེས་བྱའོ། །
en: Joyous Yearning will be foremost in terms of miraculous abilities.

source: དམ་པའི་ཆོས་ནི་ལོ་ལྔ་འབུམ་གྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for five hundred thousand years.

source: དེ་བཞིན་གཤེགས་པ་བཞི་བཅུ་པོ་དེ་དག་གིས་སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་མཛད་པ་ཇི་སྙེད་པ་དེ་སྙེད་ཅིག་ནི་དེ་བཞིན་གཤེགས་པ་འདིས་སེམས་ཅན་རྣམས་གྲོལ་བར་མཛད་པར་འགྱུར་རོ། །
en: This fortieth thus-gone one will liberate as many sentient beings as those liberated by the combined activities of all the previous thus-gone ones.

source: དེ་ལྟ་བས་ན་འདིའི་འདུས་པ་རྣམས་ཀྱང་མ་སྨོས་སོ། །
en: I shall therefore not specify his congregations.

source: ས་གཞི་ཆེན་པོ་ཡང་རིན་པོ་ཆེ་བདུན་གྱི་རང་བཞིན་དུ་འགྱུར་རོ། །
en: The great earth will become of the nature of the seven precious substances.

source: རིན་པོ་ཆེའི་ཤིང་དང་གོས་བྱུང་བའི་ཤིང་གིས་ཀྱང་རྒྱས་པར་འགྱུར་རོ། །
en: There will be trees of jewels and also trees that grow garments.

source: སེམས་ཅན་རྣམས་ནི་རྫུས་ཏེ་འབྱུང་བར་འགྱུར་རོ། །
en: Sentient beings will be born miraculously.

source: ངན་སོང་གསུམ་ཡང་གཏན་འབྱུང་བར་མི་འགྱུར་རོ།། །།
en: There will be no lower realms whatsoever.

source: དེ་བཞིན་གཤེགས་པ་ཚོགས་ཅན་སྐྱེ་བའི་ཡུལ་ནི་མཛེས་ལྡན་འགྲོ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Gaṇin will be called Beautiful Movement.

source: ཡབ་ནི་རིན་ཆེན་བླ་མ་ཞེས་བྱའོ། །
en: Highest Jewel will be his father.

source: ཡུམ་ནི་རིན་ཆེན་འོད་ཅེས་བྱའོ། །
en: Jewel Light will be his mother.

source: སྲས་ནི་ས་འཛིན་ཅེས་བྱའོ། །
en: Earth Holder will be his son.

source: རིམ་གྲོ་པ་ནི་ཡིད་ཞི་ཞེས་བྱའོ། །
en: Peaceful Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཁྲུང་ཁྲུང་ང་རོ་ཞེས་བྱའོ། །
en: Crane Call will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དོན་གྲུབ་ཅེས་བྱའོ། །
en: Objectives Accomplished will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཅིག་སྟེ་ཉན་ཐོས་འབུམ་འབྱུང་བར་འགྱུར་རོ། །
en: He will have a single congregation, consisting of a hundred thousand hearers.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབྱངས་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་འོད་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Brahmaghoṣa will be called Splendid Light.

source: ཡབ་ནི་ཚངས་པའི་བླ་མ་ཞེས་བྱའོ། །
en: Brahmā Master will be his father.

source: ཡུམ་ནི་བདེ་ལྡན་མ་ཞེས་བྱའོ། །
en: Blissful will be his mother.

source: སྲས་ནི་བསོད་ནམས་གཟི་བརྗིད་འོད་ཅེས་བྱའོ། །
en: Splendid Light will be his son.

source: རིམ་གྲོ་པ་ནི་པད་མའི་མིག་ཅེས་བྱའོ། །
en: Lotus Eye will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གསེར་མདོག་ཅེས་བྱའོ། །
en: Golden Color will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གློག་སྦྱིན་ཞེས་བྱའོ། །
en: Giver of Lightning will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་དུང་ཕྱུར་ཕྲག་བརྒྱད་དང་བྱེ་བ་ཕྲག་དྲུག་གོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུའོ། །གསུམ་པ་ལ་ནི་ཐེར་འབུམ་མོ། །
en: His first congregation will consist of eight hundred sixty million worthy ones, his second of nine hundred million worthy ones, and his third of one billion worthy ones.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དགུ་ཁྲིའོ། །
en: The extent of his lifespan will be ninety thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་སུམ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for three thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཚིགས་བརྟན་སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་རྒྱས་པ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Dṛḍhasaṃdhi will be called Blooming Flowers.

source: ཡབ་ནི་བསོད་ནམས་དགའ་ཞེས་བྱའོ། །
en: Joyous Merit will be his father.

source: ཡུམ་ནི་སྐྱིད་ལྡན་མ་ཞེས་བྱའོ། །
en: Happy will be his mother.

source: སྲས་ནི་དུས་རིག་སྦྱིན་ཞེས་བྱའོ། །
en: Giver of Knowledge of Time will be his son.

source: རིམ་གྲོ་པ་ནི་དོན་སྤྱད་ཅེས་བྱའོ། །
en: Meaningful Action will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Moon will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གསེར་མཆོག་ཅེས་བྱའོ། །
en: Supreme Gold will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་བྱེ་བ་སྟོང་ཕྲག་བདུན་ཅུའོ། །གཉིས་པ་ལ་ནི་བྱེ་བ་སྟོང་ཕྲག་བདུན་ཅུ་རྩ་བརྒྱད་དོ། །གསུམ་པ་ལ་ནི་བྱེ་བ་སྟོང་ཕྲག་བརྒྱད་ཅུའོ། །
en: His first congregation will consist of seven hundred billion worthy ones, his second of seven hundred eighty billion worthy ones, and his third of eight hundred billion worthy ones.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ལྔ་ཁྲི་ལྔ་སྟོང་ངོ་། །
en: The extent of his lifespan will be fifty-five thousand years.

source: དེ་བཞིན་གཤེགས་པ་མི་འགྱིང་བ་སྐྱེ་བའི་ཡུལ་ནི་འགྲོ་དགའ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Anunnata will be called Happy World.

source: ཡབ་ནི་རྒྱ་མཚོ་ཞེས་བྱའོ། །
en: Ocean will be his father.

source: སྲས་ནི་མིག་སྡུག་ཅེས་བྱའོ། །
en: Eye of Beauty will be his son.

source: རིམ་གྲོ་པ་ནི་སྐྱེ་དབང་ཞེས་བྱའོ། །
en: Ruler of Men will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དོན་ལེགས་བསམས་ཞེས་བྱའོ། །
en: Well-Considered Aims will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདེན་ཚིག་ཅན་ཞེས་བྱའོ། །
en: Endowed with True Words will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་བདུན་ཁྲི་བརྒྱད་སྟོང་ངོ་། །གཉིས་པ་ལ་ནི་བདུན་ཁྲི་དྲུག་སྟོང་ངོ་། །གསུམ་པ་ལ་ནི་བདུན་ཁྲི་ལྔ་སྟོང་ངོ་། །
en: His first congregation will consist of seventy-eight thousand worthy ones, his second of seventy-six thousand worthy ones, and his third of seventy-five thousand worthy ones.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་སྟོང་ཕྲག་བརྒྱད་ཁྲིའོ། །
en: The extent of his lifespan will be eighty million years.

source: དེ་བཞིན་གཤེགས་པ་འོད་མཛད་སྐྱེ་བའི་ཡུལ་ནི་གསེར་གྱི་འོད་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Prabhaṃkara will be called Golden Light.

source: འོད་ནི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཙམ་མོ། །
en: His light will extend as far as the trichiliocosm.

source: ཡབ་ནི་འོད་ཟེར་ཅན་ཞེས་བྱའོ། །
en: Radiant will be his father.

source: ཡུམ་ནི་རིན་ཆེན་བྱིན་ཞེས་བྱའོ། །
en: Jewel Gift will be his mother.

source: སྲས་ནི་ཡོན་ཏན་རིན་པོ་ཆེ་ཞེས་བྱའོ། །
en: Precious Qualities will be his son.

source: རིམ་གྲོ་པ་ནི་མེ་ཏོག་ཟླ་བ་ཞེས་བྱའོ། །
en: Moon Flower will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྣམ་པར་གྲགས་པའི་སྒྲ་ཞེས་བྱའོ། །
en: Renown will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཟུངས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Royal Master of Retention will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བྱེ་བ་འབུམ་ཕྲག་ལྔ་བཅུའོ། །གཉིས་པ་ལ་ནི་བྱེ་བ་འབུམ་ཕྲག་བཞི་བཅུའོ། །གསུམ་པ་ལ་ནི་བྱེ་བ་འབུམ་ཕྲག་སུམ་ཅུའོ། །
en: His first congregation will consist of fifty trillion hearers, his second of forty trillion hearers, and his third of thirty trillion hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་ལྔའོ། །
en: The extent of his lifespan will be fifty million years.

source: དམ་པའི་ཆོས་ནི་ལོ་ཐེར་འབུམ་ཕྲག་བདུན་གྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for seven billion years.

source: དེ་བཞིན་གཤེགས་པ་ལྷུན་ཆེན་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེ་བཀོད་པ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Mahāmeru will be called Jewel Array.

source: ཡབ་ནི་ཟླ་བའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Moon Splendor will be his father.

source: ཡུམ་ནི་ཉི་མས་བྱིན་ཞེས་བྱའོ། །
en: Given by the Sun will be his mother.

source: རིམ་གྲོ་པ་ནི་རིན་ཆེན་མཆོག་ཅེས་བྱའོ། །
en: Supreme Jewel will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་བཟངས་ཞེས་བྱའོ། །
en: Excellent Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྒྱལ་དགའ་ཞེས་བྱའོ། །
en: Victorious Joy will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་དུང་ཕྱུར་ཕྲག་བདུན་ནོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བརྒྱད་དོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུའོ། །
en: His first congregation will consist of seven hundred million worthy ones, his second of eight hundred million worthy ones, and his third of nine hundred million worthy ones.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བརྒྱད་སྟོང་ངོ་། །
en: The extent of his lifespan will be eight thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་སུམ་ཁྲི་ཉིས་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for thirty-two thousand years.

source: དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེ་སྐྱེ་བའི་ཡུལ་ནི་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Vajra will be called Spread Out Splendor.

source: འོད་ནི་དཔག་ཚད་བཅུ་དྲུག་གོ། །
en: His light will extend sixteen leagues.

source: ཡབ་ནི་ནོར་བུའི་འོད་ཅེས་བྱའོ། །
en: Jewel Light will be his father.

source: ཡུམ་ནི་ཨུད་པ་ལའི་མིག་ཅེས་བྱའོ། །
en: Utpala Eye will be his mother.

source: སྲས་ནི་འཚོ་བྱེད་ཅེས་བྱའོ། །
en: Sustainer will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དྲག་ཤུལ་སྦྱིན་ཞེས་བྱའོ། །
en: Gift of the Wrathful will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གྲོགས་མཆོག་ཅེས་བྱའོ། །
en: Supreme Companion will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དགྲ་བཅོམ་པ་ཐེར་འབུམ་ཕྲག་བཞིའོ། །གཉིས་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་གསུམ་མོ། །གསུམ་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་གཉིས་སོ། །
en: His first congregation will consist of four billion worthy hearers, his second of three billion worthy hearers, and his third of two billion worthy hearers.

source: དམ་པའི་ཆོས་ནི་ལོ་སུམ་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for thirty thousand years.

source: དེ་བཞིན་གཤེགས་པ་སྡོམ་པ་ཅན་སྐྱེ་བའི་ཡུལ་ནི་ཙན་དན་ཅན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Sañjayin will be called Endowed with Sandalwood.

source: ཡབ་ནི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower will be his father.

source: ཡུམ་ནི་གློག་འོད་མ་ཞེས་བྱའོ། །
en: Flashing Light will be his mother.

source: སྲས་ནི་རིན་ཆེན་ཕུང་པོ་ཞེས་བྱའོ། །
en: Heap of Jewels will be his son.

source: རིམ་གྲོ་པ་ནི་རིན་ཆེན་སེམས་ཞེས་བྱའོ། །
en: Jewel Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིགས་མེད་ཅེས་བྱའོ། །
en: Fearless will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རི་རྒྱལ་ཞེས་བྱའོ། །
en: King of Mountains will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་བདུན་འབུམ་མོ། །གཉིས་པ་ལ་ནི་དྲུག་འབུམ་མོ། །གསུམ་པ་ལ་ནི་ལྔ་འབུམ་མོ། །
en: His first congregation will consist of seven hundred thousand worthy ones, his second of six hundred thousand worthy ones, and his third of five hundred thousand worthy ones.

source: དེ་བཞིན་གཤེགས་པ་མི་བསྙེངས་པ་སྐྱེ་བའི་ཡུལ་ནི་དགྲ་འཇོམས་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Nirbhaya will be called Enemy Defeater.

source: འོད་ནི་དཔག་ཚད་དགུ་བཅུའོ། །
en: His light will extend ninety leagues.

source: སྲས་ནི་ཟླ་བའི་བླ་མ་ཞེས་བྱའོ། །
en: Moon Master will be his son.

source: རིམ་གྲོ་པ་ནི་ཟླ་བ་ཞེས་བྱའོ། །
en: Moon will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཚོགས་ཅན་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Gathering will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷས་བྱིན་ཞེས་བྱའོ། །
en: Given by the Gods will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་བརྒྱད་འབུམ་མོ། །གཉིས་པ་ལ་ནི་བདུན་འབུམ་བརྒྱད་ཁྲིའོ། །གསུམ་པ་ལ་ནི་བདུན་འབུམ་དྲུག་ཁྲིའོ། །
en: His first congregation will consist of eight hundred thousand worthy ones, his second of seven hundred eighty thousand worthy ones, and his third of seven hundred sixty thousand worthy ones.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་སྐྱེ་བའི་ཡུལ་ནི་མཚམས་བརྟན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Ratna will be called Stable Borders.

source: འོད་ནི་དཔག་ཚད་འབུམ་མོ། །
en: His light will extend a hundred thousand leagues.

source: ཡབ་ནི་དྲང་སྲོང་བྱིན་ཞེས་བྱའོ། །
en: Given by the Sages will be his father.

source: ཡུམ་ནི་བསོད་ནམས་བྱིན་ཞེས་བྱའོ། །
en: Merit Gift will be his mother.

source: སྲས་ནི་སྨན་གྱི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Medicinal Flower will be his son.

source: རིམ་གྲོ་པ་ནི་བརྩོན་འགྲུས་བྱིན་ཞེས་བྱའོ། །
en: Diligence Gift will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་བརྟན་ཞེས་བྱའོ། །
en: Stable Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་བཞིའོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་དྲུག་གོ། །
en: In the first congregation there will be four hundred million hearers, in the second there will be three hundred eighty million, and in the third there will be one hundred sixty million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཁྲི་བརྒྱད་སྟོང་ངོ་། །
en: The extent of his lifespan will be eighteen thousand years.

source: དེ་བཞིན་གཤེགས་པ་པད་མའི་སྤྱན་སྐྱེ་བའི་ཡུལ་ནི་ཡུལ་འཁོར་མེ་ཏོག་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Padmākṣa will be called Flower Land.

source: འོད་ནི་དཔག་ཚད་སུམ་ཅུ་རྩ་གཉིས་སོ། །
en: His light will extend thirty-two leagues.

source: ཡབ་ནི་མེ་ཏོག་བླ་མ་ཞེས་བྱའོ། །
en: Highest Flower will be his father.

source: ཡུམ་ནི་གཟུགས་ལྡན་མ་ཞེས་བྱའོ། །
en: Beauty will be his mother.

source: སྲས་ནི་ལྷ་དགའ་ཞེས་བྱའོ། །
en: Divine Joy will be his son.

source: རིམ་གྲོ་པ་ནི་མྱ་ངན་མེད་པའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Freedom from Suffering will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤེས་རབ་འོད་ཅེས་བྱའོ། །
en: Light of Insight will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཚོགས་ཅན་བྱིན་ཞེས་བྱའོ། །
en: Granted by Accumulations will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་དུང་ཕྱུར་ཕྲག་བདུན་ནོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་ལྔའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བཞིའོ། །
en: In the first congregation there will be seven hundred million worthy ones, in the second there will be three hundred fifty million, and in the third there will be four hundred million.

source: དམ་པའི་ཆོས་ནི་ལོ་ལྔ་ཁྲི་དྲུག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for fifty-six thousand years.

source: དེ་བཞིན་གཤེགས་པ་སྟོབས་སྡེ་སྐྱེ་བའི་ཡུལ་ནི་བཟང་མཆོག་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Balasena will be called Supreme Excellence.

source: འོད་ནི་དཔག་ཚད་དྲུག་གོ། །
en: His light will extend six leagues.

source: ཡབ་ནི་སྟོབས་ལྷ་ཞེས་བྱའོ། །
en: God of Strength will be his father.

source: ཡུམ་ནི་བདེ་སྦྱིན་མ་ཞེས་བྱའོ། །
en: Gift of Bliss will be his mother.

source: སྲས་ནི་བསོད་ནམས་འོད་ཟེར་ཞེས་བྱའོ། །
en: Radiance of Merit will be his son.

source: རིམ་གྲོ་པ་ནི་ཆོས་སྲུང་ཞེས་བྱའོ། །
en: Dharma Protector will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྒྱལ་བའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Victorious King will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤིན་ཏུ་བདེ་བ་ཞེས་བྱའོ། །
en: Perfectly Blissful will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་དྲུག་ཁྲིའོ། །གཉིས་པ་ལ་ནི་ལྔ་ཁྲི་བརྒྱད་སྟོང་ངོ་། །གསུམ་པ་ལ་ནི་ལྔ་ཁྲི་བདུན་སྟོང་ངོ་། །
en: In the first congregation there will be sixty thousand worthy ones, in the second there will be fifty-eight thousand, and in the third there will be fifty-seven thousand.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཁྲི་དྲུག་སྟོང་ངོ་། །
en: The extent of his lifespan will be sixteen thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་བརྒྱད་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for eight thousand years.

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་འོད་ཟེར་སྐྱེ་བའི་ཡུལ་ནི་ཟླ་བ་མེ་ཏོག་བཟང་པོ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Kusumaraśmi will be called Moon of Excellent Flowers.

source: འོད་ནི་དཔག་ཚད་བདུན་ཅུ་རྩ་བརྒྱད་དོ། །
en: His light will extend seventy-eight leagues.

source: ཡབ་ནི་སྡུག་མཐོང་ཞེས་བྱའོ། །
en: Delightful Sight will be his father.

source: ཡུམ་ནི་རྒྱུ་སྐར་ལྡན་ཞེས་བྱའོ། །
en: Star Possessor will be his mother.

source: སྲས་ནི་ཆོས་བརྟན་ཞེས་བྱའོ། །
en: Stable Dharma will be his son.

source: རིམ་གྲོ་པ་ནི་བྱང་ཆུབ་ཅེས་བྱའོ། །
en: Awakening will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དོན་གྱི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Ultimate Intelligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་བའི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Moon Banner will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་དུང་ཕྱུར་ཕྲག་གསུམ་མོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་གཉིས་སོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་གཉིས་སོ། །
en: In the first congregation there will be three hundred million worthy ones, in the second there will be three hundred twenty million, and in the third there will be three hundred twenty million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཉི་ཁྲི་ཉིས་སྟོང་ངོ་། །
en: The extent of his lifespan will be twenty-two thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་ལྔ་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for fifty thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དགྱེས་སྐྱེ་བའི་ཡུལ་ནི་ནོར་མཆོག་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Jñānapriya will be called Supreme Wealth.

source: ཡབ་ནི་དགེ་བ་ཞེས་བྱའོ། །
en: Virtue will be his father.

source: ཡུམ་ནི་དཔལ་བཟང་མོ་ཞེས་བྱའོ། །
en: Excellent Splendor will be his mother.

source: སྲས་ནི་ལྷས་སྦེད་ཅེས་བྱའོ། །
en: Hidden by the Gods will be his son.

source: རིམ་གྲོ་པ་ནི་ཕན་འདོད་ཅེས་བྱའོ། །
en: Benevolent will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་གདུགས་ཞེས་བྱའོ། །
en: Moon Canopy will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཙམ་པ་ཀ་ཞེས་བྱའོ། །
en: Campaka will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་ཐེར་འབུམ་ཕྲག་དགུའོ། །གཉིས་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་བརྒྱད་དོ། །གསུམ་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་བདུན་ནོ། །
en: In the first congregation there will be nine billion worthy ones, in the second there will be eight billion, and in the third there will be seven billion.

source: དམ་པའི་ཆོས་ནི་ལོ་ལྔ་ཁྲི་བདུན་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for fifty-seven thousand years.

source: དེ་བཞིན་གཤེགས་པ་གཟི་ཆེན་སྐྱེ་བའི་ཡུལ་ནི་མཆོད་སྦྱིན་འབྱོར་ལྡན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Mahātejas will be called Abundant Offering.

source: ཡབ་ནི་རིན་པོ་ཆེའི་མཛོད་ཅེས་བྱའོ། །
en: Jewel Treasury will be his father.

source: ཡུམ་ནི་གཟི་ལྡན་མ་ཞེས་བྱའོ། །
en: Splendid will be his mother.

source: སྲས་ནི་འོད་ཟེར་བླ་མ་ཞེས་བྱའོ། །
en: Highest Radiance will be his son.

source: རིམ་གྲོ་པ་ནི་ལག་བཟངས་ཞེས་བྱའོ། །
en: Excellent Hand will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མེ་འོད་ཅེས་བྱའོ། །
en: Radiant Fire will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་པད་མའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Lotus Essence will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་བདུན་ཁྲིའོ། །གཉིས་པ་ལ་ནི་བདུན་ཁྲི་ལྔ་སྟོང་ངོ་། །གསུམ་པ་ལ་ནི་བརྒྱད་ཁྲིའོ། །
en: In the first congregation there will be seventy thousand worthy ones, in the second there will be seventy-five thousand, and in the third there will be eighty thousand.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ལྔ་འབུམ་མོ། །
en: The extent of his lifespan will be five hundred thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་པ་སྐྱེ་བའི་ཡུལ་ནི་གསེར་མདོག་ཅན་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Brahmā will be called Gold Colored.

source: འོད་ནི་དཔག་ཚད་གསུམ་མོ། །
en: His light will extend three leagues.

source: ཡབ་ནི་མྱ་ངན་མེད་དགའ་ཞེས་བྱའོ། །
en: Joy Free from Suffering will be his father.

source: ཡུམ་ནི་ཙན་དན་ཅན་ཞེས་བྱའོ། །
en: Endowed with Sandalwood will be his mother.

source: སྲས་ནི་རྒྱལ་བའི་སྡེ་ཞེས་བྱའོ། །
en: Victorious Force will be his son.

source: རིམ་གྲོ་པ་ནི་དགྲ་འདུལ་ཞེས་བྱའོ། །
en: Enemy Tamer will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷ་བདག་ཅེས་བྱའོ། །
en: Divine Lord will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཙུག་གི་རྡོ་རྗེ་ཞེས་བྱའོ། །
en: Crown Vajra will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཅིག་ཏུ་ཟད་དེ་དགྲ་བཅོམ་པ་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །
en: There will be a single congregation consisting of eighty million worthy ones.

source: དམ་པའི་ཆོས་ནི་ལོ་ཁྲི་བཞི་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for forty-one thousand years.

source: དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་སྐྱེ་བའི་ཡུལ་ནི་ཉམས་དགའ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Amitābha will be called Delightful.

source: ཡབ་ནི་དབྱངས་ཀྱི་དབང་ཕྱུག་འོད་ཅེས་བྱའོ། །
en: Shining Master of Melodies will be his father.

source: སྲས་ནི་དགའ་ལྡན་ཞེས་བྱའོ། །
en: Joyous will be his son.

source: རིམ་གྲོ་པ་ནི་དགའ་སྡེ་ཞེས་བྱའོ། །
en: Joyous Force will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དག་པའི་དབང་ཕྱུག་ཅེས་བྱའོ། །
en: Master of Purity will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གློག་འོད་ཅེས་བྱའོ། །
en: Flashing Light will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་ཐེར་འབུམ་ཕྲག་གཉིས་སོ། །གཉིས་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་བཞིའོ། །གསུམ་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་དྲུག་གོ། །
en: In the first congregation there will be two billion worthy ones, in the second there will be four billion, and in the third there will be six billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བརྒྱད་ཁྲིའོ། །
en: The extent of his lifespan will be eighty thousand years.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་བརྒྱད་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for eighty thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཀླུས་སྦྱིན་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Nāgadatta will be called Bright Jewels.

source: ཡབ་ནི་རྒྱལ་བས་འཛིན་ཅེས་བྱའོ། །
en: Held by the Victorious One will be his father.

source: ཡུམ་ནི་མཆོག་ལྡན་མ་ཞེས་བྱའོ། །
en: Endowed with the Supreme will be his mother.

source: རིམ་གྲོ་པ་ནི་རིན་ཆེན་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Jewel Lamp will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཙམ་པ་ཀའི་མཆོག་ཅེས་བྱའོ། །
en: Supreme Campaka will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷ་མི་ཞེས་བྱའོ། །
en: Divine Human will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བརྒྱད་ཁྲིའོ། །གཉིས་པ་ལ་ནི་བདུན་ཁྲི་བརྒྱད་སྟོང་ངོ་། །གསུམ་པ་ལ་ནི་བདུན་ཁྲི་ལྔ་སྟོང་ངོ་། །
en: In the first congregation there will be eighty thousand hearers, in the second there will be seventy-eight thousand, and in the third there will be seventy-five thousand.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བདུན་ཁྲི་དྲུག་སྟོང་ངོ་། །
en: The extent of his lifespan will be seventy-six thousand years.

source: དེ་བཞིན་གཤེགས་པ་བརྟན་པར་གཤེགས་སྐྱེ་བའི་ཡུལ་ནི་བཟང་པོའི་མཆོག་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Dṛḍhakrama will be called Supreme Excellence.

source: འོད་ནི་དཔག་ཚད་ལྔ་བརྒྱའོ། །
en: His light will extend five hundred leagues.
